<a href="https://colab.research.google.com/github/Hamza1122/Customer-Segmentation-Tutor/blob/master/Untitled61.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
sns.set()

In [0]:
df=pd.read_csv("segmentation data.csv",index_col=0)

In [10]:
df.head(10)

           Sex  Marital status  Age  ...  Income  Occupation  Settlement size
ID                                   ...
100000001    0               0   67  ...  124670           1                2
100000002    1               1   22  ...  150773           1                2
100000003    0               0   49  ...   89210           0                0
100000004    0               0   45  ...  171565           1                1
100000005    0               0   53  ...  149031           1                1
100000006    0               0   35  ...  144848           0                0
100000007    0               0   53  ...  156495           1                1
100000008    0               0   35  ...  193621           2                1
100000009    0               1   61  ...  151591           0                0
100000010    0               1   28  ...  174646           2                0

[10 rows x 7 columns]

In [11]:
df.describe()

               Sex  Marital status  ...   Occupation  Settlement size
count  2000.000000     2000.000000  ...  2000.000000      2000.000000
mean      0.457000        0.496500  ...     0.810500         0.739000
std       0.498272        0.500113  ...     0.638587         0.812533
min       0.000000        0.000000  ...     0.000000         0.000000
25%       0.000000        0.000000  ...     0.000000         0.000000
50%       0.000000        0.000000  ...     1.000000         1.000000
75%       1.000000        1.000000  ...     1.000000         1.000000
max       1.000000        1.000000  ...     2.000000         2.000000

[8 rows x 7 columns]

In [12]:
df.corr()

                      Sex  Marital status  ...  Occupation  Settlement size
Sex              1.000000        0.566511  ...   -0.202491        -0.300803
Marital status   0.566511        1.000000  ...   -0.029490        -0.097041
Age             -0.182885       -0.213178  ...    0.108388         0.119751
Education        0.244838        0.374017  ...    0.064524         0.034732
Income          -0.195146       -0.073528  ...    0.680357         0.490881
Occupation      -0.202491       -0.029490  ...    1.000000         0.571795
Settlement size -0.300803       -0.097041  ...    0.571795         1.000000

[7 rows x 7 columns]